Tekla Open API Reference for Tekla Structures 2025
PlacingAttributes Constructor
 Creates a new placing attributes instance. The default parameters are: IsFixed = true, default PlacingDistanceAttributes, default PlacingQuarterAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingAttributes()
Public Sub New
See Also
Reference
PlacingAttributes Class
PlacingAttributes Overload
Tekla.Structures.Drawing Namespace